{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "__author__ = 'Герасимов Михаил Сергеевич'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите произвольное целое число: 0123456\n",
      "Максимальная цифра в числе 123456 это 6\n"
     ]
    }
   ],
   "source": [
    "# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.\n",
    "# Например, дается x = 58375.\n",
    "# Нужно вывести максимальную цифру в данном числе, т.е. 8.\n",
    "# Подразумевается, что мы не знаем это число заранее.\n",
    "# Число приходит в виде целого беззнакового.\n",
    "#Решение\n",
    "a = int(input (\"Введите произвольное целое число: \")) # int нужен на случай ввода лидирующих нулей\n",
    "a = str(a)\n",
    "\n",
    "max_digit = 0\n",
    "i = 0\n",
    "while i < len(a):\n",
    "    if int(a[i]) == 9:\n",
    "        max_digit = 9\n",
    "        break\n",
    "    elif int(a[i]) >= max_digit:\n",
    "        max_digit = int(a[i])\n",
    "    i += 1\n",
    "print('Максимальная цифра в числе', a, 'это', max_digit)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите произвольное значение a: 55\n",
      "Введите произвольное значение b: test\n",
      "до: 55 test\n",
      "после: test 55\n"
     ]
    }
   ],
   "source": [
    "# Задача-2: Исходные значения двух переменных запросить у пользователя.\n",
    "# Поменять значения переменных местами. Вывести новые значения на экран.\n",
    "# Решите задачу, используя только две переменные.\n",
    "# Решение\n",
    "a = input (\"Введите произвольное значение a: \")\n",
    "b = input (\"Введите произвольное значение b: \")\n",
    "\n",
    "print(\"до:\",a,b)\n",
    "a, b = b, a\n",
    "print(\"после:\",a,b)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите первый коэффициент a: 1\n",
      "Введите второй коэффициент b: -3\n",
      "Введите свободный член     c: -4\n",
      "У уравнения вида ( 1 )*x^2 + ( -3 )*x + ( -4 ) = 0 два корня: 4.0 и -1.0\n"
     ]
    }
   ],
   "source": [
    "# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида\n",
    "# ax2 + bx + c = 0.\n",
    "# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math\n",
    "# import math\n",
    "# math.sqrt(4) - вычисляет корень числа 4\n",
    "# Решение\n",
    "a = int(input(\"Введите первый коэффициент a: \"))\n",
    "b = int(input(\"Введите второй коэффициент b: \"))\n",
    "с = int(input(\"Введите свободный член     c: \"))\n",
    "\n",
    "import math\n",
    "\n",
    "if b**2-4*a*с < 0:\n",
    "    print(\"У уравнения вида (\",a,\")*x^2 + (\",b,\")*x + (\",с,\") = 0 нет действительных корней\")\n",
    "elif b**2-4*a*с == 0:\n",
    "    print(\"У уравнения вида (\",a,\")*x^2 + (\",b,\")*x + (\",с,\") = 0 один корень:\", -b/(2*a) )\n",
    "else:\n",
    "    x1 = (-b+math.sqrt(b**2-4*a*с))/(2*a)\n",
    "    x2 = (-b-math.sqrt(b**2-4*a*с))/(2*a)\n",
    "    print(\"У уравнения вида (\",a,\")*x^2 + (\",b,\")*x + (\",с,\") = 0 два корня:\",x1 ,'и', x2 )\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
